source/actors.lisp

;; [[file:../source.org::*Targets][Targets:1]]
(defparameter *actor-index-agent* nil)

(defun start-actor-index (system)
  (setf *actor-index-agent* (make-agent #'serapeum:dict system)))

(defun register-actor (actor-name actor-symbol)
  (setf (agent-get *actor-index-agent* #'identity) (serapeum:dict* (agent-get *actor-index-agent*) actor-name actor-symbol)))

(defun get-dest-actor (actor)
  (serapeum:@  (agent-get *actor-index-agent* #'identity) actor))

(defun route-target (target actor)
  (let ((dest (get-dest-actor actor)))
    (format t "got ~a" actor)
    (when dest
      (tell dest target))))
;; Targets:1 ends here

(in-package :sento-user)

(defparameter *couchdb-agent* nil)
(defun make-couchdb-agent (context client
                           &key (error-fun nil) (dispatcher-id :shared))
  (make-agent (lambda ()
                client
                context dispatcher-id)))


(defun couchdb-agent-client (agent)
  (agt:agent-get agent #'identity))


(defun couchdb-agent-insert (agent database document)
  (cl-couch:create-document (couchdb-agent-client agent) database document))

(defun couchdb-agent-update (agent database document revision)
  (cl-couch:create-document (couchdb-agent-client agent) (jsown:to-json)
                            (jsown:extend-js (jsown:parse document)
                              ("_rev" revision))))

(defun couchdb-agent-delete (agent database document-id)
  (cl-couch:delete-document (couchdb-agent-client agent) database document-id))

(defun couchdb-agent-get-view (agent database ddoc view query-json)
  (cl-couch:get-view (couchdb-agent-client agent) database ddoc view query-json))


(defun start-couchdb-agent (system)
  (let ((client (couch:new-couchdb star:*couchdb-host* star:*couchdb-port*)))
    (couch:password-auth client star:*couchdb-user* star:*couchdb-password*)
    (setf *couchdb-agent* (make-couchdb-agent system client))))

;; [[file:../source.org::*couchdb-insert actor][couchdb-insert actor:1]]
(defparameter *couchdb-inserts* nil)
(defun start-couchdb-inserts (system)
  (setf *couchdb-inserts* (actor-of system
                                    :name "*couchdb-inserts*"
                                    :receive (lambda (msg)
                                               (let ((destination-db star:*couchdb-default-database*))
                                                 (format t "inserting: ~a" msg)
                                                 (when (not (cl-couch:document-exists-p (couchdb-agent-client *couchdb-agent*) destination-db (jsown:val (cdr msg) "_id")))
                                                   (print (couchdb-agent-insert *couchdb-agent* destination-db (jsown:to-json* (cdr msg)))))
                                                 (force-output))))))
;; couchdb-insert actor:1 ends here

;; [[file:../source.org::*couchdb-get actor][couchdb-get actor:1]]
(defparameter *couchdb-gets* nil "The Couchdb actor responsible for handling document gets.")

(defun start-couchdb-gets (system)
  (setf *couchdb-gets* (ac:actor-of system :name "*couchdb-gets*"
                                           :receive (lambda (msg)
                                                      (let ((pool *couchdb-pool*)
                                                            (db (uiop:getenv "COUCHDB_DATABASE")))
                                                        (with-context (*sys*)
                                                          (anypool:with-connection (client pool)
                                                            (task-async (lambda ()
                                                                          (handler-case
                                                                              (cl-couch:get-document client db (car msg))
                                                                            (dex:http-request-not-found (e) nil)
                                                                            (dex:http-request-unauthorized (e) nil)))
                                                                        :on-complete-fun (lambda (doc)
                                                                                           (reply doc (cdr msg)))))))))))
;; couchdb-get actor:1 ends here

;; [[file:../source.org::*finish bulk insert actor][finish bulk insert actor:1]]
;; (defparameter *couchdb-bulk-insert* (ac:actor-of *sys*
;;                                                  :name "*couchdb-bulk-insert*"
;;                                                  :receive (lambda (msg)
;;                                                             (let ((destination-db (uiop:getenv "COUCHDB_DATABASE"))
;;                                                                   (pool *couchdb-pool*))
;;                                                               (anypool:with-connection (client pool)
;;                                                                 (cl-couch:bulk-create-documents client destination-db msg :batch "normal"))))))
;; finish bulk insert actor:1 ends here
