source/actors.lisp

(defparameter *targets* nil)
(defparameter *target-filter* ())
(defun get-targets (client database)
  (let ((jdata (jsown:val-safe (jsown:parse (cl-couch:get-view client star:*couchdb-default-database* "targets" "actor-targets" (jsown:to-json (jsown:new-js
                                                                                                                                                 ("include_docs" "true"))))) "rows")))
    (when (> 0 (length jdata))
      (loop for row in jdata
            for doc = (jsown:val row "doc")
            for actor = (jsown:val doc "actor")
            collect (cons actor doc)))))

(defun sumbit-target (target &optional (first-time t))
  "Create a message for the *targets* actor."
  (tell *targets*  (if first-time
                       (cons t target)
                       (cons nil target))))

(defun first-time-p (msg)
  (car msg))

(defun target-transient-p (target)
  (when (jsown:val-safe target "transient")
    t))

(defun start-target-loader ()
  (let (targets (get-targets (anypool:with-connection (client *couchdb-pool*)
                               (get-targets client star:*couchdb-default-database*))))
    (loop for target in targets
          do (submit-target target t))))


(defun start-target-actor (system)
  (setf *targets* (actor-of system
                            :name "*targets*"
                            :receive (lambda (msg)
                                       (let* ((target (cdr msg))
                                              (actor (jsown:val target "actor"))
                                              (delay (jsown:val-safe target "delay")))
                                         (print target)
                                         (if (not (get-dest-actor actor))
                                             (progn (print "not in system")
                                                    (star.consumers:emit-document  "documents" (format nil "actors.~a.new-target" actor)
                                                                                   (jsown:to-json target)
                                                                                   :host star:*rabbit-address*
                                                                                   :port star:*rabbit-port*
                                                                                   :username star:*rabbit-user* :password star:*rabbit-password*)))

                                         (if (and (get-dest-actor actor) (jsown:val target "recurring") (first-time-p msg))
                                             (wt:schedule-recurring *target-timer* 0.0 delay (lambda ()
                                                                                               (submit-target target nil))
                                                                    (jsown:val target "target")))
                                         (if (and (get-dest-actor actor) (not (first-time-p msg)))
                                             (route-target target actor)))))))

;; [[file:../source.org::*Target Actor][Target Actor:2]]
(defparameter *target-timer* nil)
(defun start-target-timer ()
  (setf *target-timer* (wt:make-wheel-timer :resolution 10 :max-size 1000)))
;; Target Actor:2 ends here

;; [[file:../source.org::*actor entry point][actor entry point:1]]
(defun start-actors ()
  (start-actor-system)
  (start-couchdb-agent *sys*)
  (start-actor-index *sys*)
  (start-couchdb-gets *sys*)
  (start-couchdb-inserts *sys*)
  (start-target-timer)
  (start-target-actor *sys*))
;; actor entry point:1 ends here
