source.org
**** Get Targets for actor
#+begin_src lisp :tangle ./source/frontends/http-api.lisp :results none :comments link
(setf (ningle:route *app* "/targets/:actor" :method :get)
      #'(lambda (params)
          (let ((targets (loop for row in (anypool:with-connection (client *couchdb-pool*)
                                            (jsown:val (jsown:parse (cl-couch:get-view client star:*couchdb-default-database* "targets" "actor-targets" (jsown:to-json
                                                                                                                                                         (jsown:new-js
                                                                                                                                                           ("include_docs" "true")
                                                                                                                                                           ("keys" (list (cdr (assoc :actor params :test #'string=)))))))) "rows"))
                               collect (jsown:val row "doc"))))
            (jsown:to-json targets))))

#+end_src

***** example usage
#+begin_src http
GET 127.0.0.1:5000/targets/fediwatch-users
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Date: Mon, 29 Apr 2024 02:39:55 GMT
: Server: Hunchentoot 1.3.0
: Transfer-Encoding: chunked
: Content-Type: text/html; charset=utf-8
:
: [{"_id":"foo","_rev":"1-91936a7aa9ea16e64a8c0b584bc6c98a","version":"0.7.2","actor":"fediwatch-users","dataset":"fedi","target":"https://mastodon.social/@dylanabbott","delay":1,"recurring":true}]


***** api-client get-targets
#+begin_src lisp :tangle ./source/api-client.lisp :results none :comments link
(defmethod get-targets ((client star-client) actor-name)
  "Get all targets for ACTOR-NAME."
  (api-request client (format nil "/targets/~a" actor-name)))
#+end_src

**** TODO Create Target
#+begin_src lisp :tangle ./source/frontends/http-api.lisp :results none :comments link
(setf (ningle:route *app* "/new/target/:actor" :method :post)
      #'(lambda (params)

          (let* ((actor  (cdr (assoc :actor params :test #'string=)))
                 (body (babel:octets-to-string  (lack.request:request-content (ningle:context :request)) :encoding :utf-8))
                 (routing-key (format nil "documents.new.target.~a" actor)))
            (star.rabbit:emit-document "documents" routing-key body :properties (list (cons :type "target")))
            body)))

#+end_src


#+RESULTS:

#+begin_src http
POST http://127.0.0.1:5000/new/target/fediwatch-timeline

{"_id":"test-agents1","version":"0.7.2","actor":"fediwatch","dataset":"fedi","target":"https://mastodon.social/@dylanabbott","delay":1,"recurring":true}
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Date: Thu, 09 May 2024 20:03:22 GMT
: Server: Hunchentoot 1.3.0
: Transfer-Encoding: chunked
: Content-Type: text/html; charset=utf-8
:
: {"_id":"test-agents1","version":"0.7.2","actor":"fediwatch","dataset":"fedi","target":"https://mastodon.social/@dylanabbott","delay":1,"recurring":true}

***** Api client new-target

#+begin_src lisp :tangle ./source/api-client.lisp :results none :comments link
(defmethod new-target ((client star-client) target-doc actor &optional (transient nil))
  "Insert new target."
  (if transient
      (api-request client (format nil "/new/target/~a" actor) :method :post
                                                              :content (jsown:to-json (jsown:extend-js (jsown:remkey  (jsown:parse target-doc) "options")
                                                                                        ("transient" t))))
      (api-request client (format nil "/new/target/~a" actor) :method :post
                                                              :content (jsown:to-json (jsown:remkey (jsown:parse  target-doc) "options")))))
#+end_src

****** api client import from csv
#+begin_src lisp :tangle ./source/api-client.lisp :results none
(defun read-targets-csv (targets-file)
  (let ((targets (data-table:select-columns  (cl-csv:get-data-table-from-csv targets-file) (list "dataset" "target" "actor" "recurring" "delay" "options"))))
    (loop for row in (data-table:rows targets)
          collect (cons (nth 2 row) (with-output-to-string (str)
                                       (cl-json:encode-json
                                        (spec:new-target (nth 0 row)
                                                         (nth 1 row)
                                                         (nth 2 row)
                                                         :options (nth 5 row)
                                                         :recurring (cond ((string= (string-downcase (nth 3 row)) "true") t)
                                                                          ((string= (string-downcase (nth 3 row)) "t") t)
                                                                          ((string= (nth 3 row) "1") t)
                                                                          ((string= (nth 3 row) "0") nil)
                                                                          ((string= (string-downcase (nth 3 row)) "nil") nil)
                                                                          ((string= (string-downcase (nth 3 row)) "false") nil))
                                                         :delay (nth 4 row)) str))))))

(defmethod import-targets-from-csv ((client star-client) file)
  (loop for target in (read-targets-csv file)
        do (new-target client (cdr target) (car target))))
#+end_src


*** TODO design map api
*** Submit documents
This route take input documents and inserts them into the rabbitmq =new-documents= queue.


#+begin_src lisp :tangle ./source/frontends/http-api.lisp :comments link
;; (setf (ningle:route *app* "/new/document/:dtype" :method :post)
;;       #'(lambda (params)

;;           (let ((dtype  (cdr (assoc :dtype params :test #'string=)))
;;                 (body (lack.request:request-content (ningle:context :request))))

;;             (star.rabbit:emit-document  "new-documents" "documents"  (format nil "documents.new.~a" dtype) body :properties (list (list :headers `("dtype" . ,dtype))))
;;             (format nil "documents.new.~a" dtype))))


(setf (ningle:route *app* "/new/document/:dtype" :method :post)
      #'(lambda (params)

          (let* ((dtype  (cdr (assoc :dtype params :test #'string=)))
                 (body (babel:octets-to-string  (lack.request:request-content (ningle:context :request)) :encoding :utf-8))
                 (routing-key (format nil "documents.new.~a" dtype)))
             (cl-rabbit:with-connection (conn)
              (let ((socket (cl-rabbit:tcp-socket-new conn)))
                (cl-rabbit:socket-open socket star:*rabbit-address* star:*rabbit-port*)
                (cl-rabbit:login-sasl-plain conn "/" star:*rabbit-user* star:*rabbit-password*)
                (cl-rabbit:with-channel (conn 1)
                  (cl-rabbit:basic-publish conn 1 :routing-key routing-key :exchange "documents"  :properties (list (cons :type dtype )) :body body))))
            (print "got new document")
            (force-output)
            body)))



#+end_src

#+RESULTS:
: #<FUNCTION (LAMBDA (PARAMS)) {1001E3305B}>

**** example usage
#+begin_src http :comments none
POST http://0.0.0.0:5000/new/document/person

{"_id": "6y4q","dataset":"","dtype":"person", "version":"0.7.1","dateUpdated":1713387117,"dateAdded":1713387117,"fname":"Klaus","mname":"","lname":"Shwabb","bio":"","dob":"","race":"","region":"", "etype":"","eid":""}
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Date: Thu, 09 May 2024 16:40:45 GMT
: Server: Hunchentoot 1.3.0
: Transfer-Encoding: chunked
: Content-Type: text/html; charset=utf-8
:
: {"_id": "6y4q","dataset":"","dtype":"person", "version":"0.7.1","dateUpdated":1713387117,"dateAdded":1713387117,"fname":"Klaus","mname":"","lname":"Shwabb","bio":"","dob":"","race":"","region":"", "etype":"","eid":""}
**** api client submit-document
#+begin_src lisp :tangle ./source/api-client.lisp :results none :comments link
(defmethod submit-document ((client star-client) document document-type)
  "Create a new document"
  (api-request client (format nil "/new/document/~a" document-type) :method :post :content document))
#+end_src
*** TODO Get Documents

#+begin_src lisp :tangle ./source/frontends/http-api.lisp :results none :comments link
(setf (ningle:route *app* "/document/:id" :method :get)
      #'(lambda (params)

          (let ((document-id  (cdr (assoc :id params :test #'string=))))

            (anypool:with-connection (client *couchdb-pool*)
              (cl-couch:get-document client star:*couchdb-default-database* document-id)))))
#+end_src

**** example usage
#+begin_src http
GET 127.0.0.1:5000/document/test-agents1
#+end_src

#+RESULTS:
**** api-client get-document
#+begin_src lisp :tangle ./source/api-client.lisp :results none :comments link
(defmethod get-document ((client star-client) document-id)
  "Get the document by id."
  (api-request client (format nil "/documents/~a" document-id)))
#+end_src

*** Start webapp
#+begin_src lisp :tangle ./source/frontends/http-api.lisp :comments link
                                        ;(couchdb-middleware *app*)
(defun start-http-api ()
  (clack:clackup *app* :address star:*http-api-address* :port star:*http-api-port*))
#+end_src

#+RESULTS:
: #S(CLACK.HANDLER::HANDLER
:    :SERVER :HUNCHENTOOT
:    :SWANK-PORT NIL
:    :ACCEPTOR #<BORDEAUX-THREADS-2:THREAD "clack-handler-hunchentoot" {10051132F3}>)


* Main Entry
** Cli arg parsing
i opt to use clingon for cli arg parsing.[fn:2]
#+begin_src lisp :tangle ./source/main.lisp :results none :coments link
(in-package :starintel-gserver)
(defun server/options ()
  (list
   (clingon:make-option
    :string
    :description "Path to init file"
    :short-name #\i
    :long-name "init"
    :initial-value "./init.lisp"
    :env-vars '("STAR_SERVER_INIT_FILE")
    :key :init-value)
   (clingon:make-option
    :boolean
    :description "Enable Remote debugging"
    :short-name #\d
    :long-name "debugger"
    :key :debugger)))


#+end_src
** Server command handler
#+begin_src lisp :tangle ./source/main.lisp :results none :comments link


;; (defun server/handler (cmd))
  ;; (let ((debugger (clingon:getopt cmd :debugger))
  ;;       (init-file (clingon:getopt cmd :init-value)))
  ;;   (when debugger
  ;;     (slynk:create-server :port 50006 :dont-close t))
  ;;   (load init-file :if-does-not-exist :create)
  ;;   (sento-user::start-actors)
  ;;   (star.rabbit::start-rabbit-document-thread :host *rabbit-address* :port *rabbit-port*)
  ;;   (star.rabbit::start-rabbit-targets-thread :host *rabbit-address* :port *rabbit-port*)
  ;;   (init-db)
  ;;   (star.frontends.http-api::start-http-api)
  ;;   (sento-user::start-target-loader))


;; (defun server/command ()
;;   "A command to greet someone"
;;   (clingon:make-command
;;    :name "start"
;;    :description "start the server"
;;    :version "0.1.0"
;;    :authors '("nsaspy <nsaspy@airmail.cc>")
;;    :license "GPL v3"
;;    :options (server/options)
;;    :handler #'server/handler))


(defun main ()
  (let ((init-file "init.lisp"))
    (init-db)
    (sento-user::start-actors)
    (star.rabbit::start-rabbit-document-thread :host *rabbit-address* :port *rabbit-port*)
    (star.rabbit::start-rabbit-targets-thread :host *rabbit-address* :port *rabbit-port*)
    (load init-file :if-does-not-exist :create)
    (star.frontends.http-api::start-http-api)
    (sleep 5))
    ;(bt:make-thread #'sento-user::start-target-loader :name "*target-loader*"))
  (loop do (sleep 1)))
#+end_src

* Tasks
All tasks can have a very general headline, but the NAME must be topic.possibpe-sub-topic.thing scheme.
This section is for [[https://github.com/TxGVNN/project-tasks][project-tasks]].

#+Name:  open.rabbitmq
#+begin_src shell :async :results none
xdg-open http://127.0.0.1:15672/#/
#+end_src

#+Name: open couchdb
#+begin_src shell :async :results none
xdg-open http://127.0.0.1:5983/_utils
#+end_src



** Updates
#+Name: update.flake
#+begin_src shell :async :results output replace
nix flake update
direnv reload .
#+end_src

#+RESULTS: update.flake

#+RESULTS: Update flake
** Docker
*** Run a rabbitmq instance
#+Name: docker.run.rabbitmq
#+begin_src shell :async :results output replace :tangle start.sh
docker run -d -p 5672:5672 -p 15672:15672 -e RABBITMQ_USER=user -e RABBITMQ_PASS=password   rabbitmq:3.13.1-management
#+end_src

#+RESULTS: docker.run.rabbitmq
: 136e9a2898d2fd0d89d9d86ab88e67edeeb8167f2e979b153105256bd2a3726b

#+RESULTS: Start Rabbitmq

*** Kill Rabbitmq
#+Name: docker.kill.rabbitmq
#+begin_src shell :async :results output replace
docker kill rabbitmq_org_dev
#+end_src

#+RESULTS: docker.kill.rabbitmq
: rabbitmq_org_dev


*** List Docker PS
#+Name: docker.ps
#+begin_src shell :async :results output replace
docker ps
#+end_src
** Build
#+Name: build.server
#+begin_src sh :async :results output replace
make build
#+end_src

#+RESULTS: build.server
: b3bc5811a0bf8b118f78669339185d13

* Footnotes
[fn:2] https://github.com/dnaeon/clingon

[fn:1] https://gist.github.com/dnaeon/3a3f86dea1096db5a9231d1f56a565e2
